# Pemrograman 6 - Python for Data Science

- Nama            : Arman Dwi Pangestu
- NIM             : 1221604
- Program Studi   : Teknik Informatika
- Semester        : 6 (Genap)
- Mata Kuliah     : Pemrograman 6
- Dosen           : Mina Ismu Rahayu
- Tugas           : Praktikum 1 - `Percobaan Library Dasar`

# Table of Contents atau Daftar Isi

- [Python Libraries for Data Science](#python-libraries-for-data-science)
    - [Berikut ini adalah beberapa toolbox atau library Python yang digunakan](#berikut-ini-adalah-beberapa-toolbox-atau-library-python-yang-digunakan)
    - [Library untuk Visualisasi](#library-untuk-visualisasi)
    - [NumPy](#numpy)
    - [SciPy](#scipy)
    - [Pandas](#pandas)
    - [SciKit-Learn](#scikit-learn)
    - [Matplotlib](#matplotlib)
    - [Seaborn](#seaborn)
- [Mengakses Library Python](#mengakses-library-python)
    - [Pandas - Membaca Data](#pandas---membaca-data)
        - [Exploring Data Frames](#exploring-data-frames)
        - [Exercises - Pandas](#exercises---pandas)
            - [Baca 10 Record Pertama](#baca-10-record-pertama)
            - [Baca 20 Record Pertama](#baca-20-record-pertama)
            - [Baca 30 Record Pertama](#baca-30-record-pertama)
        - [Data Frame - Tipe Data](#data-frame---tipe-data)
        - [Data Frames Attribute](#data-frames-attributes)
        - [Pandas - Hands-on Exercises](#pandas---hands-on-exercises)
            - [Bagaimana mengetahui jumlah record dalam dataframe?](#bagaimana-mengetahui-jumlah-record-dalam-dataframe)
            - [Berapa jumlah elemen yang terdapat dalam dataframe?](#berapa-jumlah-elemen-yang-terdapat-dalam-dataframe)
            - [Apa saja nama kolom dalam dataframe?](#apa-saja-nama-kolom-dalam-dataframe)
            - [Berapa jenis kolom dalam dataframe?](#berapa-jenis-kolom-dalam-dataframe)
        - [Data Frames Methods](#data-frames-methods)
        - [Pandas - Hands-on Exercises 2](#pandas---hands-on-exercises-2)
            - [Buatlah summary untuk kolom dengan data numerik](#buatlah-summary-untuk-kolom-dengan-data-numerik)
            - [Hitung standard deviation untuk seluruh data numerik](#hitung-standard-deviation-untuk-seluruh-data-numerik)
            - [Berapa nilai mean untuk 50 records pertama dalam dataset?](#berapa-nilai-mean-untuk-50-records-pertama-dalam-dataset)
        - [Selecting a column in a Data Frame](#selecting-a-column-in-a-data-frame)
        - [Pandas - Hands-on Exercises 3](#pandas---hands-on-exercises-3)
            - [Lakukan perhitungan dasar statistika untuk kolom salary](#lakukan-perhitungan-dasar-statistika-untuk-kolom-salary)
            - [Temukan berapa jumlah nilai dalam kolom salary](#temukan-berapa-jumlah-nilai-dalam-kolom-salary)
            - [Hitung rata-rata salary](#hitung-rata-rata-salary)
        - [Data Frames - Group By](#data-frames---group-by)
        - [Data Frame - Filtering](#data-frame---filtering)
        - [Data Frames - Slicing](#data-frames---slicing)
        - [Data Frames - Selecting rows](#data-frames---selecting-rows)
        - [Data Frames - Method Loc](#data-frames---method-loc)
        - [Data Frames - Method Iloc](#data-frames---method-iloc)
        - [Data Frames - Sorting](#data-frames---sorting)
        - [Missing Values](#missing-values)
        - [Pandas - Aggregation Method](#pandas---aggregation-method)
            - [Aggregation Functions in Pandas](#aggregation-functions-in-pandas)
            - [Basic Descriptive Statistics](#basic-descriptive-statistics)
    - [Fungsi Grafis Untuk Explore Data](#fungsi-grafis-untuk-explore-data)
    - [Basic Statistical Analysis](#basic-statistical-analysis)

# Python Libraries for Data Science

## Berikut ini adalah beberapa toolbox atau library Python yang digunakan

- NumPy
- SciPy
- Pandas
- SciKit-Learn

## Library untuk visualisasi

- Matplotlib
- Seaborn

dan lainnya.

## NumPy:

- Object yang dideklarasikan untuk array multidimensi dan matrik, objek numpy banyak digunakan untuk mempermudah proses komputasi matematik dan statistic.
- Menyediakan vektorisasi operasi matematik array dan matrik yang memiliki performa yang sangat baik
- Beberapa library python dibangun menggunakan NumPy

## SciPy:

- Merupakan koleksi algoritma aljabar linier, rumus-rumus diferensial, integrasi numeric, optimasi, statistika dan lainnya
- Merupakan bagian SciPy Stack
- Dibangun menggunakan library NumPy

## Pandas:

- Menambahkan struktur data dan tools yang dirancang untuk menjelaskan data dalam bentuk table (mirip dengan series dan Data Frames di Bahasa R).
- Menyediakan tools untuk manipulasi data, reshaping, merging, sorting, slicing, aggregation, dan lainnya.
- Memungkinkan untuk melakukan handling terhadap `missing` data.

## SciKit-Learn:

- Menyediakan beberapa algoritma machine learning, klasifikasi, regressi, kusterisasi, validasi model, dan lainnya.
- Dibangun dari NumPy, SciPy dan Matplotlib.

## Matplotlib:

- Merupakan library plotting 2 Dimensi yang dapat menghasilkan pemetaan yang memiliki berbagai macam variasi dari format data matriks.
- Kumpulan fungsionalitas visualisasi yang mirip dengan matlab.
- Line plots, scatter plots, barcharts, histograms, pie charts, dan lainnya.
- Lebih cocok untuk data dasar (low-level data), beberapa Teknik diperlukan untuk melakukan visualisasi lanjut untuk data yang lebih kompleks.

## Seaborn:

- Dibangun menggunakan matplotlib.
- Menyediakan interface untuk data high level yang dapat menggambarkan grafis untuk data statistic yang lebih atraktif.
- Mirip dengan ggplot2 dalam Bahasa R.

# Mengakses Library Python:

In [2]:
# Import Python Libraries
import numpy as np
import scipy as sp
import pandas as pd
import matplotlib as mpl
import seaborn as sns

## Pandas - Membaca Data:

In [4]:
# Read CSV File
df = pd.read_csv("../../Resource/Pertemuan2/Salaries.csv")

Terdapat beberapa perintah pandas untuk membaca format data:

- XLSX File

```python
pd.read_excel('myfile.xlsx', sheet_name='Sheet1', index_col=None, na_values=['NA])
```

- DTA File

```python
pd.read_stata('myfile.dta')
```

- SAS File

```python
pd.read_sas('myfile.sas7bdat')
```

- HDF File

```python
pd.read_hdf('myfile.h5', 'df')
```

### Exploring Data Frames

In [3]:
# List first 5 records
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

### Exercises - Pandas:

- Baca 10, 20, 30 record pertama
- Bagaimana menampilkan data record paling akhir?

#### Baca 10 Record Pertama

In [4]:
df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

#### Baca 20 Record Pertama

In [5]:
df.head(20)

         rank discipline  phd  service   sex  salary
0        Prof          B   56       49  Male  186960
1        Prof          A   12        6  Male   93000
2        Prof          A   23       20  Male  110515
3        Prof          A   40       31  Male  131205
4        Prof          B   20       18  Male  104800
5        Prof          A   20       20  Male  122400
6   AssocProf          A   20       17  Male   81285
7        Prof          A   18       18  Male  126300
8        Prof          A   29       19  Male   94350
9        Prof          A   51       51  Male   57800
10       Prof          B   39       33  Male  128250
11       Prof          B   23       23  Male  134778
12   AsstProf          B    1        0  Male   88000
13       Prof          B   35       33  Male  162200
14       Prof          B   25       19  Male  153750
15       Prof          B   17        3  Male  150480
16   AsstProf          B    8        3  Male   75044
17   AsstProf          B    4        0  Male   92000
18       Prof          A   19        7  Male  107300
19       Prof          A   29       27  Male  150500

#### Baca 30 Record Pertama

In [6]:
df.head(30)

         rank discipline  phd  service   sex  salary
0        Prof          B   56       49  Male  186960
1        Prof          A   12        6  Male   93000
2        Prof          A   23       20  Male  110515
3        Prof          A   40       31  Male  131205
4        Prof          B   20       18  Male  104800
5        Prof          A   20       20  Male  122400
6   AssocProf          A   20       17  Male   81285
7        Prof          A   18       18  Male  126300
8        Prof          A   29       19  Male   94350
9        Prof          A   51       51  Male   57800
10       Prof          B   39       33  Male  128250
11       Prof          B   23       23  Male  134778
12   AsstProf          B    1        0  Male   88000
13       Prof          B   35       33  Male  162200
14       Prof          B   25       19  Male  153750
15       Prof          B   17        3  Male  150480
16   AsstProf          B    8        3  Male   75044
17   AsstProf          B    4        0  Male   92000
18       Prof          A   19        7  Male  107300
19       Prof          A   29       27  Male  150500
20   AsstProf          B    4        4  Male   92000
21       Prof          A   33       30  Male  103106
22   AsstProf          A    4        2  Male   73000
23   AsstProf          A    2        0  Male   85000
24       Prof          A   30       23  Male   91100
25       Prof          B   35       31  Male   99418
26       Prof          A   38       19  Male  148750
27       Prof          A   45       43  Male  155865
28   AsstProf          B    7        2  Male   91300
29       Prof          B   21       20  Male  123683

### Data Frame - Tipe Data

| Pandas Type | Native Python Type | Description |
| -- | -- | -- |
| object | string | The most general dtype. Will be assigned to your column if column has mixed types (numbers and strings). |
| int64 | int | Numeric characters. 64 refers to the memory allocated to hold this character. |
| float64 | float | Numeric characters with decimals. If a column contains numbers and NaNs (see below), pandas will default to float64, in case your missing value has a decimal. |
| datetime64, timedelta[ns] | N/A (but see the [datetime](https://docs.python.org/2/library/datetime.html) module in Python's standard library) | Values mean to hold time data. Look into these for time series experiments. |

In [7]:
# Check a particular column type
df['salary'].dtype

dtype('int64')

In [8]:
# Check types for all the columns
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

### Data Frames Attributes

Python objects have attributes and methods.

| df.`attribute` | Description |
| -- | -- |
| dtypes | List the types of the columns |
| columns | List the column names |
| axes | List the row labels and columns names |
| ndim | Number of dimensions |
| size | Number of elements |
| shape | Return a tuple representing the dimensionality |
| values | Numpy representaion of the data |

### Pandas - Hands-on Exercises

- Bagaimana mengetahui jumlah record dalam dataframe?
- Berapa jumlah elemen yang terdapat dalam dataframe?
- Apa saja nama kolom dalam dataframe?
- Berapa jenis kolom dalam dataframe?

#### Bagaimana mengetahui jumlah record dalam dataframe?

In [12]:
print("Jumlah baris dan kolom:", df.shape)
print("Jumlah record:", df.shape[0])

Jumlah baris dan kolom: (78, 6)
Jumlah record: 78

#### Berapa jumlah elemen yang terdapat dalam dataframe?

In [13]:
print("Jumlah elemen:", df.size)

Jumlah elemen: 468

#### Apa saja nama kolom dalam dataframe?

In [16]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

#### Berapa jenis kolom dalam dataframe?

In [17]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

### Data Frames Methods

Unlike attributes, python methods have parenthesis.
All attributes and methods can be listed with a `dir()` function: `dir(df)`

| df.`method()` | Description |
| -- | -- |
| head( [n] ), tail( [n] ) | First/last n rows |
| describe() | Generate descriptive statistics (for numeric columns only) |
| max(), min() | Return max/min values for all numeric columns |
| mean(), median() | Return mean/median values for all numeric columns |
| std() | Standard deviation |
| sample([n]) | Returns a random sample of the data frame |
| dropna() | Drop all the records with missing values |

### Pandas - Hands-on Exercises 2

- Buatlah summary untuk kolom dengan data numerik
- Hitung standard deviation untuk seluruh data numerik
- Berapa nilai mean untuk 50 records pertama dalam dataset?

#### Buatlah summary untuk kolom dengan data numerik

In [19]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

#### Hitung standard deviation untuk seluruh data numerik

In [24]:
df.select_dtypes(include=['number']).std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [25]:
std_sluruh_data = df.select_dtypes(include=['number']).std().mean()
print("Standar deviation untuk seluruh data numerik:", std_sluruh_data)

Standar deviation untuk seluruh data numerik: 9439.433071585127

#### Berapa nilai mean untuk 50 records pertama dalam dataset?

In [29]:
mean_50_records = df.select_dtypes(include=['number']).head(50).mean()
print("Nilai mean untuk 50 records pertama:")
print(mean_50_records)

Nilai mean untuk 50 records pertama:
phd            21.52
service        17.60
salary     113789.14
dtype: float64

### Selecting a column in a Data Frame

- *Method 1*: Subset the data frame using column name: `df['sex']`
- *Method 2*: Use the column name as an attribute: `df.sex`

### Pandas - Hands-on Exercises 3

- Lakukan perhitungan dasar statistika untuk kolom salary
- Temukan berapa jumlah nilai dalam kolom salary
- Hitung rata-rata salary

#### Lakukan perhitungan dasar statistika untuk kolom salary

In [31]:
summary_salary = df.salary.describe()
print("Summary statstik untuk kolom 'salary':")
print(summary_salary)

Summary statstik untuk kolom 'salary':
count        78.000000
mean     108023.782051
std       28293.661022
min       57800.000000
25%       88612.500000
50%      104671.000000
75%      126774.750000
max      186960.000000
Name: salary, dtype: float64

#### Temukan berapa jumlah nilai dalam kolom salary

In [32]:
total_salary = df.salary.sum()
print("Jumlah nilai dalam kolom 'salary':", total_salary)

Jumlah nilai dalam kolom 'salary': 8425855

#### Hitung rata-rata salary

In [33]:
average_salary = df.salary.mean()
print("Rata-rata dari kolom 'salary':", average_salary)

Rata-rata dari kolom 'salary': 108023.78205128205

### Data Frames - Group By

Kegunaan method `groupby()`:

- Split data kedalam grup berdasarkan beberapa kriteria
- Kalkulasi proses statistic (atau menambahkan fungsi) untuk setiap grup

In [41]:
# Group data using rank
df_rank = df.groupby(['rank'])[['phd', 'service', 'salary']]

In [44]:
# Calculate mean value for each numeric column per each group
df_rank.mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

Satu object `group by` yang dibentuk dapat melakukan berbagai macam kalkulasi statistik bagi masing-masing grup nya.

In [45]:
# Calculate mean salary for each professor rank:
df.groupby('rank')[['salary']].mean()

                  salary
rank
AssocProf   91786.230769
AsstProf    81362.789474
Prof       123624.804348

Catatan penggunaan `groupby` method:

- Proses group atau split
- Membuat object groupby merupakan verifikasi bahwa proses pemetaan dilakukan valid.
- Secara default proses sorting oromatis selema proses group by dilakukan.
- Gunakan `sort=False` untuk me-nonaktifkan sorting agar dapat meningkatkan perfomance:

In [46]:
# Calculate mean salary for each professor rank:
df.groupby(['rank'], sort=False)[['salary']].mean()

                  salary
rank
Prof       123624.804348
AssocProf   91786.230769
AsstProf    81362.789474

### Data Frame - Filtering

Untuk melakukan subset data kita dapat menggunakan Boolean indexing. Indexing biasanya dikenal sebagai filter. Sebagai contoh jika kita ingin melakukan subset terhadap baris yang memiliki salary lebih dari $120:

In [49]:
# Calculate mean salary for each professor rank:
df_sub = df[df['salary'] > 120000]
print(df_sub)

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
3   Prof          A   40       31    Male  131205
5   Prof          A   20       20    Male  122400
7   Prof          A   18       18    Male  126300
10  Prof          B   39       33    Male  128250
11  Prof          B   23       23    Male  134778
13  Prof          B   35       33    Male  162200
14  Prof          B   25       19    Male  153750
15  Prof          B   17        3    Male  150480
19  Prof          A   29       27    Male  150500
26  Prof          A   38       19    Male  148750
27  Prof          A   45       43    Male  155865
29  Prof          B   21       20    Male  123683
31  Prof          B   22       21    Male  155750
35  Prof          B   28       23    Male  126933
36  Prof          B   45       45    Male  146856
39  Prof          B   18       18  Female  129000
40  Prof          A   39       36  Female  137000
44  Prof          B   23       19  Female  151768
45  Prof          B   25       25  Female  140096
49  Prof          B   17       18  Female  122960
51  Prof          B   20       14  Female  127512
58  Prof          B   36       26  Female  144651
72  Prof          B   24       15  Female  161101
75  Prof          B   17       17  Female  124312

Terdapat beberapa operator yang dapat digunakan:

| Operator | Name |
| -- | -- |
| > | Greater |
| < | Less |
| == | Equal |
| >= | Greater or Equal |
| <= | Less or Equal |
| != | Not Equal |

In [50]:
# Select only those rows that contain female professors:
df_f = df[df['sex'] == 'Female']
print(df_f)

         rank discipline  phd  service     sex  salary
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000
44       Prof          B   23       19  Female  151768
45       Prof          B   25       25  Female  140096
46   AsstProf          B   11        3  Female   74692
47  AssocProf          B   11       11  Female  103613
48       Prof          B   17       17  Female  111512
49       Prof          B   17       18  Female  122960
50   AsstProf          B   10        5  Female   97032
51       Prof          B   20       14  Female  127512
52       Prof          A   12        0  Female  105000
53   AsstProf          A    5        3  Female   73500
54  AssocProf          A   25       22  Female   62884
55   AsstProf          A    2        0  Female   72500
56  AssocProf          A   10        8  Female   77500
57   AsstProf          A    3        1  Female   72500
58       Prof          B   36       26  Female  144651
59  AssocProf          B   12       10  Female  103994
60   AsstProf          B    3        3  Female   92000
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
63       Prof          A   29       27  Female   91000
64  AssocProf          A   26       24  Female   73300
65       Prof          A   36       19  Female  117555
66   AsstProf          A    7        6  Female   63100
67       Prof          A   17       11  Female   90450
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

### Data Frames - Slicing

Beberapa cara untuk melakukan subset data frame:

- Satu atau lebih kolom
- Satu atau lebih baris
- Beberapa data subtitusi dari baris dan kolom

Select data 1 kolom dengan hasil berupa data series (bukan dataframe)

In [51]:
# Select column salary:
df['salary']

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

Select data lebih dari 1 kolom dengan hasil berupa dataframe

In [52]:
# Select column salary:
df[['rank', 'salary']]

         rank  salary
0        Prof  186960
1        Prof   93000
2        Prof  110515
3        Prof  131205
4        Prof  104800
..        ...     ...
73       Prof  105450
74  AssocProf  104542
75       Prof  124312
76       Prof  109954
77       Prof  109646

[78 rows x 2 columns]

### Data Frames - Selecting rows

select a range of rows, dengan menggunakan `:`

In [53]:
# Select rows by their position:
df[10:20]

        rank discipline  phd  service   sex  salary
10      Prof          B   39       33  Male  128250
11      Prof          B   23       23  Male  134778
12  AsstProf          B    1        0  Male   88000
13      Prof          B   35       33  Male  162200
14      Prof          B   25       19  Male  153750
15      Prof          B   17        3  Male  150480
16  AsstProf          B    8        3  Male   75044
17  AsstProf          B    4        0  Male   92000
18      Prof          A   19        7  Male  107300
19      Prof          A   29       27  Male  150500

Baris pertama dimulai dari 0 sampai n-1 atau untuk contoh diatas dari 10 sampai 19

### Data Frames - Method Loc

Untuk melakukan select terhadap nama index, kita dapat menggunakan loc:

In [54]:
# Select rows by their labels:
df_sub.loc[10:20, ['rank', 'sex', 'salary']]

    rank   sex  salary
10  Prof  Male  128250
11  Prof  Male  134778
13  Prof  Male  162200
14  Prof  Male  153750
15  Prof  Male  150480
19  Prof  Male  150500

### Data Frames - Method Iloc

Untuk melakukan select terhadap posisi index, kita dapat menggunakan iloc:

In [55]:
# Select rows by their index:
df_sub.iloc[10:20, [0, 3, 4, 5]]

    rank  service     sex  salary
26  Prof       19    Male  148750
27  Prof       43    Male  155865
29  Prof       20    Male  123683
31  Prof       21    Male  155750
35  Prof       23    Male  126933
36  Prof       45    Male  146856
39  Prof       18  Female  129000
40  Prof       36  Female  137000
44  Prof       19  Female  151768
45  Prof       25  Female  140096

In [56]:
df.iloc[0] # First row of a data frame

rank            Prof
discipline         B
phd               56
service           49
sex             Male
salary        186960
Name: 0, dtype: object

In [58]:
df.iloc[0 + 1] # (i+1)th row

rank           Prof
discipline        A
phd              12
service           6
sex            Male
salary        93000
Name: 1, dtype: object

In [59]:
df.iloc[-1] # Last row

rank            Prof
discipline         A
phd               23
service           15
sex           Female
salary        109646
Name: 77, dtype: object

In [60]:
df.iloc[:, 0] # First column

0          Prof
1          Prof
2          Prof
3          Prof
4          Prof
        ...
73         Prof
74    AssocProf
75         Prof
76         Prof
77         Prof
Name: rank, Length: 78, dtype: object

In [61]:
df.iloc[:, -1] # Last column

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

In [62]:
df.iloc[0:7] # First 7 rows

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285

In [63]:
df.iloc[:, 0:2] # First 2 columns

         rank discipline
0        Prof          B
1        Prof          A
2        Prof          A
3        Prof          A
4        Prof          B
..        ...        ...
73       Prof          B
74  AssocProf          B
75       Prof          B
76       Prof          A
77       Prof          A

[78 rows x 2 columns]

In [71]:
df.iloc[1:3, 0:2] # Second through third rows and first 2 columns

   rank discipline
1  Prof          A
2  Prof          A

In [72]:
df.iloc[[0, 5], [1,3]] # 1st and 6th rows and 2nd and 4th columns

  discipline  service
0          B       49
5          A       20

### Data Frames - Sorting

Pengurutan data berdasarkan nilai dari suatu kolom, secara default proses sorting menggunakan ascending dan akan menghasilkan nilai balik berupa data frame

In [74]:
# Create a new data frame from the original sorted by the column Salaray
df_sorted = df.sort_values(by='service')
df_sorted.head()

        rank discipline  phd  service     sex  salary
55  AsstProf          A    2        0  Female   72500
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000

Pengurutan terhadap 2 atau lebih kolom:

In [77]:
df_sorted = df.sort_values(by=['service', 'salary'], ascending=[True, False])
df_sorted.head(10)

        rank discipline  phd  service     sex  salary
52      Prof          A   12        0  Female  105000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
55  AsstProf          A    2        0  Female   72500
57  AsstProf          A    3        1  Female   72500
28  AsstProf          B    7        2    Male   91300
42  AsstProf          B    4        2  Female   80225
68  AsstProf          A    4        2  Female   77500

### Missing Values

Missing values ditandai dengan NaN

In [79]:
# Read a dataset with missing values
flights = pd.read_csv("http://rcs.bu.edu/examples/python/DataAnalysis/flights.csv")

In [80]:
# Select the rows that have at least one missing value
flights[flights.isnull().any(axis=1)].head()

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
330,2013,1,1,1807.0,29.0,2251.0,NaN,UA,N31412,1228,EWR,SAN,NaN,2425,18.0,7.0
403,2013,1,1,NaN,NaN,NaN,NaN,AA,N3EHAA,791,LGA,DFW,NaN,1389,NaN,NaN
404,2013,1,1,NaN,NaN,NaN,NaN,AA,N3EVAA,1925,LGA,MIA,NaN,1096,NaN,NaN
855,2013,1,2,2145.0,16.0,NaN,NaN,UA,N12221,1299,EWR,RSW,NaN,1068,21.0,45.0
858,2013,1,2,NaN,NaN,NaN,NaN,AA,NaN,133,JFK,LAX,NaN,2475,NaN,NaN

Terdapat beberapa method atau function yang dapat dimanfaatkan untuk menanggulangi missing values dalam data frame, diantaranya adalah sebagai berikut ini:

| df.method() | Description |
| -- | -- |
| dropna() | Drop missing observations |
| dropna(how='all') | Drop observations where all cells is NA |
| dropna(axis=1, how='all') | Drop column if all the values are missing |
| dropna(thresh=5) | Drop rows that contain less than 5 non-missing values |
| fillna(0) | Replace missing values is missing |
| isnull() | Returns True if the value is missing |
| notnull() | Returns True for non-missing values |

- Ketika dilakukan `summing` data, missing values akan diidentifikasi dengan nilai 0.
- Jika tidak memiliki nilai, maka nilai akan menjadi NaN.
- `cumsum()` dan `cumprod()` methods akan mengabaikan missing values tetapi nilai tidak akan dihilangkan dari arrays.
- Tidak ada group by dalam missing values.
- Beberapa method statistik mengakomodasi fungsi *skipna* untuk melakukan kontrol ketika missing values tidak diperlukan.

### Pandas - Aggregation Method

Aggregation - melakukan komputasi kumpulan data:

- Compute group sums or means
- Compute group sizes or counts

Beberapa aggregation method, diataranya adalah sebagai berikut ini:

- min
- max
- count
- sum
- prod
- mean
- median
- mode
- mad
- std
- var

#### Aggregation Functions in Pandas

`agg()` method mudah digunakan ketika beberapa perhitungan statistik dilakukan dalam satu kolom :

In [81]:
flights[['dep_delay', 'arr_delay']].agg(['min', 'mean', 'max'])

        dep_delay    arr_delay
min    -33.000000   -75.000000
mean     9.463773     2.094537
max   1014.000000  1007.000000

#### Basic Descriptive Statistics

| df.method() | Description |
| -- | -- |
| describe | Basic statistics (count, mean, std, min, quantiles, max) |
| min, max | Minimum and maximum values |
| mean, median, mode | Aritmetic average, median and mode |
| var, std | Variance and standard deviation |
| sem | Standard error of mean |
| skew | Sample skewness |
| kurt | kurtosis |

## Fungsi Grafis Untuk Explore Data

To show graphs within Python Jupyter Notebook include inline directive:

In [82]:
matplotlib inline

### Graphics Method

| Method | Description |
| -- | -- |
| displot | Histogram |
| barplot | Estimate of central tendency for a numeric variable |
| violinplot | Similar to boxplot, also shows the probability density of the data |
| joinplot | Scatterplot |
| regplot | Regression plot |
| pairplot | Pairplot |
| boxplot | Boxplot |
| swarmplot | Categorical Scatterplot |
| factorplot | General categorical plot |

## Basic Statistical Analysis

Statsmodel and scikit-learn - both have a number of function for statistical analysis

The first one is mostly used for regular analysis using R style formulas, while scikit-learn is more tailored for Machine Learning.

statsmodels:
- linear regressions
- ANOVA tests
- hypothesis testings
- many more ...

scikit-learn:
- kmeans
- support vector machines
- random forests
- many more ...